{
  "_instructions": "Add your work experience here. Copy the experience object for each job.",
  "sectionTitle": "Professional Experience",
  "experiences": [
    {
      "title": "AI Automation Engineer",
      "company": "Jignect",
      "period": "May 2024 – Jul 2025",
      "location": "",
      "description": "Enhanced Python automation frameworks with robust error handling, minimizing false positives and achieving zero critical defects across 50+ test suites. Integrated ML-based validation checks into testing workflows, improving pre-release quality by 25%. Implemented automated testing frameworks within CI/CD pipelines, reducing deployment failures by 20%. Accelerated test suite performance through parallelization strategies, diminishing test execution duration by 30% and freeing up crucial CI/CD pipeline resources for subsequent builds. Spearheaded a data validation pipeline using Great Expectations and Spark, reducing data-related incidents by 40%.",
      "responsibilities": [
        "Enhanced Python automation frameworks with robust error handling, minimizing false positives and achieving zero critical defects across 50+ test suites",
        "Integrated ML-based validation checks into testing workflows, improving pre-release quality by 25%",
        "Implemented automated testing frameworks within CI/CD pipelines, reducing deployment failures by 20%",
        "Accelerated test suite performance through parallelization strategies, diminishing test execution duration by 30% and freeing up crucial CI/CD pipeline resources for subsequent builds",
        "Spearheaded a data validation pipeline using Great Expectations and Spark, reducing data-related incidents by 40%"
      ]
    },
    {
      "title": "Data Science Intern",
      "company": "SlashMark",
      "period": "Dec 2023 – Mar 2024",
      "location": "",
      "description": "Trained a TensorFlow CNN on 35,000+ retinal images, classifying five diabetic retinopathy stages with 96.3% training. Engineered a data preprocessing pipeline featuring image resizing, normalization, and augmentation, achieving a 28% reduction in training loss over 25 epochs. Applied SHAP-based explainability analysis on model predictions, identifying top 5 key retinal features to support responsible AI practices in diagnostics. Optimized model inference time by 35% through quantization while maintaining accuracy, enabling faster processing of retinal images. Deployed model as a proof-of-concept via API endpoint, integrating into an existing diagnostic workflow and processing 12 images per minute.",
      "responsibilities": [
        "Trained a TensorFlow CNN on 35,000+ retinal images, classifying five diabetic retinopathy stages with 96",
        "3% training",
        "Engineered a data preprocessing pipeline featuring image resizing, normalization, and augmentation, achieving a 28% reduction in training loss over 25 epochs",
        "Applied SHAP-based explainability analysis on model predictions, identifying top 5 key retinal features to support responsible AI practices in diagnostics",
        "Optimized model inference time by 35% through quantization while maintaining accuracy, enabling faster processing of retinal images",
        "Deployed model as a proof-of-concept via API endpoint, integrating into an existing diagnostic workflow and processing 12 images per minute"
      ]
    }
  ]
}